app/Controllers/Dashboard.php

    public function index()
    {
        $kamarModel      = new KamarModel();
        $penyewaModel    = new PenyewaModel();
        $pembayaranModel = new PembayaranModel();
        $pengajuanModel  = new PengajuanModel();

        // Kumpulkan data ringkasan untuk ditampilkan di kartu-kartu dashboard
        $data = [
            'title'          => 'Dashboard',
            'total_kamar'    => $kamarModel->countAll(),
            'kamar_kosong'   => $kamarModel->where('status', 'kosong')->countAllResults(),
            'kamar_terisi'   => $kamarModel->where('status', 'terisi')->countAllResults(),
            'total_penyewa'  => $penyewaModel->where('status', 'aktif')->countAllResults(),
            'pembayaran_bulan_ini' => $pembayaranModel
                ->where('bulan', date('F'))
                ->where('tahun', date('Y'))
                ->countAllResults(),
---
SELECT COUNT(*) AS `numrows` FROM `kamar`
SELECT COUNT(*) AS `numrows`
FROM `kamar`
WHERE `status` = 'kosong'
SELECT COUNT(*) AS `numrows`
FROM `kamar`
WHERE `status` = 'terisi'
SELECT COUNT(*) AS `numrows`
FROM `penyewa`
WHERE `status` = 'aktif'
SELECT COUNT(*) AS `numrows`
FROM `pembayaran`
WHERE `bulan` = 'August'
AND `tahun` = '2026'