app/Controllers/Kamar.php

SELECT *
FROM `kamar`
ORDER BY `nomor_kamar` ASC
---
    public function index()
    {
        $data = [
            'title' => 'Data Kamar',
            'kamar' => $this->kamarModel->orderBy('nomor_kamar', 'ASC')->findAll(),