app/Controllers/Pengajuan.php

    public function updateStatus($id)
    {
        $pengajuan = $this->pengajuanModel->find($id);

        if (! $pengajuan) {
            return redirect()->to('/pengajuan')->with('error', 'Data pengajuan tidak ditemukan.');
        }

        $statusLama = strtolower($pengajuan['status']);
        $statusBaru = strtolower($this->request->getPost('status'));

        // Kalau admin cuma iseng mencet tombol tapi statusnya gak berubah, langsung kembalikan
        if ($statusLama === $statusBaru) {
            return redirect()->to('/pengajuan');
        }

        // 1. Update status di tabel pengajuan
        $this->pengajuanModel->update($id, ['status' => $statusBaru]);

        // 2. LOGIKA OTOMATIS JIKA STATUS BERUBAH MENJADI "DITERIMA"
        if ($statusBaru === 'diterima') {
            // A. Update status kamar jadi terisi
            $this->kamarModel->update($pengajuan['kamar_id'], ['status' => 'terisi']);

            // B. Masukkan data ke tabel Penyewa
            $penyewaModel = new \App\Models\PenyewaModel();

            // Cek biar gak double insert
            $cekPenyewa = $penyewaModel->where('nama', $pengajuan['nama'])
                                       ->where('kamar_id', $pengajuan['kamar_id'])
                                       ->first();

            if (!$cekPenyewa) {
                $penyewaModel->insert([
                    'kamar_id'      => $pengajuan['kamar_id'],
                    'nama'          => $pengajuan['nama'],
                    'no_hp'         => $pengajuan['no_hp'],
                    'tanggal_masuk' => $pengajuan['tanggal_masuk'],
                    'status'        => 'aktif'
                ]);
---
SELECT *
FROM `pengajuan`
WHERE `pengajuan`.`id` = '6'
UPDATE `pengajuan` SET `status` = 'diterima', `updated_at` = '2026-08-19 08:02:20'
WHERE `pengajuan`.`id` IN ('6')
UPDATE `kamar` SET `status` = 'terisi', `updated_at` = '2026-08-19 08:02:20'
WHERE `kamar`.`id` IN ('2')
SELECT *
FROM `penyewa`
WHERE `nama` = 'satya angga selamanya'
AND `kamar_id` = '2'
 LIMIT 1
INSERT INTO `penyewa` (`kamar_id`, `nama`, `no_hp`, `tanggal_masuk`, `status`, `created_at`, `updated_at`) VALUES ('2', 'satya angga selamanya', '0812676769', '2026-08-19', 'aktif', '2026-08-19 08:02:20', '2026-08-19 08:02:20')