app/Controllers/Penyewa.php

SELECT *
FROM `users`
ORDER BY `created_at` DESC
SELECT *
FROM `penyewa`
WHERE `nama` = 'Kemnaker'
 LIMIT 1
---
    public function index()
    {
        // Ambil semua data pengguna (bisa dikecualikan admin kalau mau, tapi ini ambil semua dulu)
        $pengguna = $this->userModel->orderBy('created_at', 'DESC')->findAll();

        foreach ($pengguna as &$user) {
            // Kasih nilai default strip (-) kalau dia calon penyewa
            $user['tanggal_masuk'] = '-';

            // Kalau statusnya penyewa, baru kita cari tanggal masuknya
            if ($user['status'] === 'penyewa') {
                // Cari di tabel penyewa yang namanya sama dengan nama_lengkap si user
                $dataPenyewa = $this->penyewaModel->where('nama', $user['nama_lengkap'])->first();