app/Controllers/PublicSite.php

SELECT *
FROM `kamar`
WHERE `status` = 'kosong'
---
    public function index()
    {
        $data = [
            'title'        => 'Selamat Datang',
            'kamarTersedia'=> $this->kamarModel->where('status', 'kosong')->findAll(),