app/Models/PembayaranModel.php

SELECT `pembayaran`.*, `penyewa`.`nama` as `nama_penyewa`, `penyewa`.`tanggal_masuk`, `kamar`.`nomor_kamar`
FROM `pembayaran`
JOIN `penyewa` ON `penyewa`.`id` = `pembayaran`.`penyewa_id`
JOIN `kamar` ON `kamar`.`id` = `penyewa`.`kamar_id`
ORDER BY `pembayaran`.`tanggal_bayar` DESC
---
    public function getPembayaranWithPenyewa($id = null)
    {
        $builder = $this->select('pembayaran.*, penyewa.nama as nama_penyewa, penyewa.tanggal_masuk, kamar.nomor_kamar')
                         ->join('penyewa', 'penyewa.id = pembayaran.penyewa_id')
                         ->join('kamar', 'kamar.id = penyewa.kamar_id');

        if ($id !== null) {
            return $builder->where('pembayaran.id', $id)->first();
        }

        return $builder->orderBy('pembayaran.tanggal_bayar', 'DESC')->findAll();