app/Models/PengajuanModel.php

SELECT `pengajuan`.*, `kamar`.`nomor_kamar`, `kamar`.`tipe_kamar`
FROM `pengajuan`
JOIN `kamar` ON `kamar`.`id` = `pengajuan`.`kamar_id`
ORDER BY `pengajuan`.`created_at` DESC
---
    public function getPengajuanWithKamar($id = null)
    {
        $builder = $this->select('pengajuan.*, kamar.nomor_kamar, kamar.tipe_kamar')
                         ->join('kamar', 'kamar.id = pengajuan.kamar_id');

        if ($id !== null) {
            return $builder->where('pengajuan.id', $id)->first();
        }

        return $builder->orderBy('pengajuan.created_at', 'DESC')->findAll();

SELECT COUNT(*) AS `numrows`
FROM `pengajuan`
WHERE `status` = 'baru'
---
    public function countBaru()
    {
        return $this->where('status', 'baru')->countAllResults();

SELECT `pengajuan`.*, `kamar`.`nomor_kamar`, `kamar`.`tipe_kamar`, `kamar`.`harga_bulanan`
FROM `pengajuan`
JOIN `kamar` ON `kamar`.`id` = `pengajuan`.`kamar_id`
WHERE `pengajuan`.`user_id` = '7'
ORDER BY `pengajuan`.`created_at` DESC
---
    public function getPengajuanByUser($userId)
    {
        return $this->select('pengajuan.*, kamar.nomor_kamar, kamar.tipe_kamar, kamar.harga_bulanan')
                    ->join('kamar', 'kamar.id = pengajuan.kamar_id')
                    ->where('pengajuan.user_id', $userId)
                    ->orderBy('pengajuan.created_at', 'DESC')
                    ->findAll();